#+TITLE:Compound if structures
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++
#+STARTUP: overview hideblocks
#+OPTIONS: toc:1 ^:nil
#+PROPERTY: header-args:C :main yes
#+PROPERTY: header-args:C :includes <stdio.h>
#+PROPERTY: header-args:C :exports both
#+PROPERTY: header-args:C :results output
#+PROPERTY: header-args:C :comments both
* README

  * [X] Work through this notebook at your own pace. When you're done,
    check a task off by typing ~C-c C-c~ on the line with the ~[
    ]~. Check this task off for practice! You can close bullet points
    with the ~<TAB>~  key on your keyboard

  * [X] Make sure that you can run C where you are by executing the
    code block below (~C-c C-c~) and then saving the file (~C-x C-s~)
    #+name: helloworld
    #+begin_src C :main yes :includes <stdio.h>
      puts("hello world");
    #+end_src

    #+RESULTS: helloworld
    : hello world

  * [X] If this does not lead to the output ~hello world~, try to
    analyze the problem by yourself first. Typical sources of errors:
    - Can you write to the directory?
    - Is this file an Org-file?
    - Did you use the correct key sequence?
    - Do you have the right code block header arguments?

  * This section follows chapter 3 in Davenport/Vine (2015) and
    chapters 4 and 5 in King (2008).

* Logical operators &&, ||, !

  Show the output produced by each of the following expressions with
  the given values - calculate the result in your head before you run
  the code!

  * [X] Check if NOT ~i~ is smaller than ~j~, for ~i=10~ and ~j=5~.

    #+name: logical1
    #+begin_src C
      int i = 10, j = 5;
      printf("%d\n", !i < j); // !10 is 0, and 5 > 0 is TRUE (1)
    #+end_src

    #+RESULTS: logical1
    : 1

  * [ ] Check the value of ~!!i + !j~, for ~i=2~ and ~j=1~.

    #+name: logical2
    #+begin_src C :exports both
      int i = 2, j = 1;
      printf("%d\n", !!i + !j ); // !!2 = !(!1) = !0 = 1, !1 = 0 => 1 + 0 = 0
    #+end_src

    #+RESULTS: logical2
    : 1

  * [ ] Compute ~i~ AND ~j~ OR ~k~, for ~i=5~, ~j=0~, ~k=-5~.

    #+name: logical3
    #+begin_src C :exports both
      int i = 5, j = 0, k = -5;
      printf("%d\n", i && j || k ); // 5 && 0 == 0, 0 || -5 == 1
    #+end_src

    #+RESULTS: logical3
    : 1

  * [ ] Compute ~i < j~ OR  ~k~, for ~i=1~, ~j=2~, ~k=3~.

    #+name: logical4
    #+begin_src C :exports both
      int i = 1, j = 2, k = 3;
      printf("%d\n",  i < j || k); // 1 < 2 == TRUE == 1, 1 || 3 == 1
    #+end_src

    #+RESULTS: logical4
    : 1

* Caveat: i < j < k

  * In C, the expression ~i < j < k~ is perfectly legal but it does
    NOT check if ~j~ is between ~i~ and ~k~.

  * The relational operator ~<~ is evaluated from the left. First the
    Boolean value of ~i < j~ is computed. It is either 0 or 1.

  * [ ] Next, the check ~0 < k~ or ~1 < k~ is performed. The following
    example shows how this can go wrong. Run it for illustration.

    #+name: caveat
    #+begin_src C :results output
      int i = 5, j = 1, k = 100;
      if (i < j < k) {
	printf("TRUE: %d < %d < %d\n", i, j, k);
       } else {
	printf("NOT TRUE: %d < %d < %d\n", i, j, k);
       }
    #+end_src

    #+RESULTS: caveat
    : TRUE: 5 < 1 < 100


  * [ ] Fix the the code [[caveat1]] so that the output is correct. Test
    it for different values of i, j, k.

    #+name: caveat1
    #+begin_src C :results output
      int i = 5, j = 1, k = 100;
      if (i < j < k) {
	printf("TRUE: %d < %d < %d\n", i, j, k);
       } else {
	printf("NOT TRUE: %d < %d < %d\n", i, j, k);
       }
    #+end_src

